
export const FREELANCER_CATEGORIES: { [key: string]: string } = {
  all: 'التصنيفات الرئيسية',
  design: 'التصميم والجرافيك',
  writing: 'الكتابة والترجمة',
  video: 'الفيديو والصور',
  web: 'تطوير المواقع',
  programming: 'البرمجة والتطبيقات',
  marketing: 'التسويق الرقمي',
};

export const FREELANCER_SUBCATEGORIES: { [key: string]: string } = {
  all: 'التصنيفات الفرعية',
  logo: 'تصميم الشعارات',
  ui: 'تصميم واجهات المستخدم',
  branding: 'الهوية البصرية',
  copywriting: 'الكتابة الإبداعية',
  seo: 'SEO',
  webdev: 'تطوير الويب',
  mobile: 'تطوير التطبيقات',
};

export const PRODUCT_CATEGORIES: { [key: string]: string } = {
  all: 'التصنيفات الرئيسية',
  'مواقع جاهزة': 'مواقع جاهزة',
  'تصاميم جاهزة': 'تصاميم جاهزة',
  'شعارات جاهزة': 'شعارات جاهزة',
  'كتب جاهزة': 'كتب جاهزة',
  'قوالب جاهزة': 'قوالب جاهزة',
  'رسوميات جاهزة': 'رسوميات جاهزة',
  'سكريبتات جاهزة': 'سكريبتات جاهزة',
};

export const WILAYAS: string[] = [
  "أدرار", "الشلف", "الأغواط", "أم البواقي", "باتنة", "بجاية", "بسكرة", "بشار", "البليدة", "البويرة",
  "تمنراست", "تبسة", "تلمسان", "تيارت", "تيزي وزو", "الجزائر", "الجلفة", "جيجل", "سطيف", "سعيدة",
  "سكيكدة", "سيدي بلعباس", "عنابة", "قالمة", "قسنطينة", "المدية", "مستغانم", "المسيلة", "معسكر",
  "ورقلة", "وهران", "البيض", "إليزي", "برج بوعريريج", "بومرداس", "الطارف", "تندوف", "تيسمسيلت",
  "الوادي", "خنشلة", "سوق أهراس", "تيبازة", "ميلة", "عين الدفلى", "النعامة", "عين تموشنت", "غرداية",
  "غليزان", "تيميمون", "برج باجي مختار", "أولاد جلال", "بني عباس", "عين صالح", "عين قزام", "تقرت",
  "جانت", "المغير", "المنيعة"
];
